[
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2025-03-04 09:58:29",
        "title": "Everyones been waiting for my next DD.....here it is. The 50 bagger play of the week. 5,000% returns",
        "selftext": "Positions are Shares and $260, $280 and $300 weekly calls. Positions below: \n\nhttps://preview.redd.it/ed87uekusome1.png?width=2382&format=png&auto=webp&s=d4aac9c53371924092cc489960b9cfee29d71353\n\n",
        "upvoteRatio": 0.9399999976158142
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2025-01-11 14:28:37",
        "title": "These calls could be 100 Baggers. Turn $1,000 into $100,000",
        "selftext": "Okay, so everyone remembers me when I gave you the 500 bagger play on $DJT in March and everyone made a ton of money. I also gave the $DJT play in Jan and in Sep 2024. Well we're back one final time. \n\nI want to keep this DD super simple. $DJT is Trump's tech company he owns like 60% of called Trump Media & Technology Group. Everyone knows their earnings are shit but the company has NEVER traded based on earnings. The stock has been trading for 4 years now (first as DWAC now as DJT). If you look at the chart over the past 4 years the stock basically trades flat but has these insane 100% - 300% pumps for a week and then falls again. Let's look at what caused these insane run ups in the past.\n\n* Nov 2022: Trump announces he was running for President - **Stock went up 100% in a week**\n* Jan 2024: Trump wins Iowa Primary - **Stock went up 300% in a week**\n* Jun 2024: First Presidential debate with Trump / Biden - **Stock went up 60% in a week**\n* Sep/Oct 2024: Presidential Election run-up - **Stock went up 400% in a couple weeks** \n\nThe final play in my opinion is the Inauguration happening **Jan 20th** (next week). It's going to be the biggest event in the world that day, everyone's going to be there and Trump will officially be President of the United States. I believe $DJT is going to have an insane run-up starting on Monday (we were green Friday even though the market was blood red). My positions are below: \n\nhttps://preview.redd.it/mlu0pd9u0fce1.png?width=2398&format=png&auto=webp&s=7c4527ea0b5890466b23df7c0580ed5b2fedecde\n\n**Positions:** Shares and OTM calls. I believe the Inauguration run-up will start Monday. I could be wrong, but if I am wrong, this will be the first time there's a major event with Trump that $DJT did NOT run up. So I am 95% sure I'll be right. ",
        "upvoteRatio": 0.9100000262260437
    },
    {
        "subredditNamePrefixed": "r/Ferrari",
        "author": "kk7766",
        "createdAt": "2024-12-02 14:18:08",
        "title": "Bianco Cervino or Bianco Avus for Matte White? ",
        "selftext": "I'm buying a 2022 - 2023 Portofino M and wanted to get Matte White with a Red interior. Obviously it doesn't come standard Matte White so it has to be a Xpel Stealth Wrap. I'm wondering would the Xpel Stealth Wrap look better on Bianco Cervino or Bianco Avus? Does anyone have photos? Thanks ",
        "upvoteRatio": 0.6700000166893005
    },
    {
        "subredditNamePrefixed": "r/options",
        "author": "kk7766",
        "createdAt": "2024-10-25 11:18:38",
        "title": "Does anyone trade a large number of contracts? 1,000+ at a time? ",
        "selftext": "So I use E-Trade and have a pretty big account. I've been trading options for 5 years now as my job. As I started getting to the 1,000+ contract mark, when I \"sell to close\" sometimes it doesn't sell right away. Even if my limit order is lower than the bid price. E-Trade says at random \"large orders are subject to manual review\" so this takes 1 - 2 minutes before the contracts can sell and if you're swing trading it can be devastating to the price. It usually happens randomly with 500+ contracts. Is there any brokers out there that does NOT randomly put orders in limbo for a minute even if it's like 10,000 contracts at once? ",
        "upvoteRatio": 0.8299999833106995
    },
    {
        "subredditNamePrefixed": "r/houseplants",
        "author": "kk7766",
        "createdAt": "2024-09-02 01:15:17",
        "title": "I bought this plant and the lady at the store said to only water it once a month with 2 quarts of water",
        "selftext": "Is watering once a month with two quarts of water accurate? Seems like a lot of water and a long space in-between. I'm in New York \n\nhttps://preview.redd.it/oll9xrz6ybmd1.jpg?width=1242&format=pjpg&auto=webp&s=3ed19ada3287b5548ba935096626591b111281c5\n\n",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/macbookpro",
        "author": "kk7766",
        "createdAt": "2024-07-18 20:20:47",
        "title": "Is the M3 chip that much faster than the M1 chip in terms of browsing pages in Safari and refresh speed? ",
        "selftext": "I trade stocks for a living so even a fraction of a second in refresh speed / browsing pages matters. I have a 1 TB M1 Macbook Pro from 2022 and just got a 1 TB M3 Macbook Pro today. Right away I noticed my browsing and page refresh speeds were faster. I'm not sure if that's because the M3 computer is brand new and there's 0 storage on it, or it's because of the M3 chip.",
        "upvoteRatio": 0.3799999952316284
    },
    {
        "subredditNamePrefixed": "r/apple",
        "author": "kk7766",
        "createdAt": "2024-07-18 20:19:44",
        "title": "Is the M3 chip that much faster than the M1 chip in terms of browsing pages in Safari and refresh speed? ",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/etrade",
        "author": "kk7766",
        "createdAt": "2024-07-17 12:21:24",
        "title": "Any big option day-traders on E-Trade? 2 Million+ accounts? ",
        "selftext": "I've been using E-Trade for 5 years now and love the platform better than all the other brokers. However recently I've come into an issue when selling large options orders. If I have a large amount of contracts (500 - 1,000+) and try to close them sometimes they don't execute. Even if my limit price is higher than the bid. It gets frozen for about 1 minute - 2 minutes. I called E-Trade and they said sometimes certain orders that pose a \"large risk\" have to go through a manual review before they can be executed. However if you're a trader, 1 - 2 minutes is way too long to wait. I've been able to bypass this if I break up the orders. For example instead of closing 1,000 contracts at once I can break it down into 300, 300 and 400 and don't run into this issue. However that takes time and as a trader it can be too much time. \n\nAre there any big traders here that have this same problem? Have you found any solutions? If I increase my account size and start trading 5,000 contracts at once I can't possibly break them into 20 orders of 250. I don't know why SELLING options you own for CASH is considered a \"risk\" as it's not margin or anything. Stopping the order from executing poses much more risk to an account. Do other brokers do this too? ",
        "upvoteRatio": 0.7099999785423279
    },
    {
        "subredditNamePrefixed": "r/Superstonk",
        "author": "kk7766",
        "createdAt": "2024-06-10 21:07:25",
        "title": "For anyone still holding $GME...",
        "selftext": "Congrats, you're a bagholder. And all the downvoting of this post won't make the stock go higher. You lose.\n\nAlso if DFV is reading this: all you talked about on Friday is how $GME is a long-term investment, betting on Ryan Cohen for the long-term, turn-around story that will take 2 - 3 years. Okay, but you literally bought call options expiring next week. You were clearly trying to pump and dump the stock with the twitter memes, reddit posts and then the live stream. You timed everything perfectly, and it almost worked, but guess what, Ryan Cohen dumped his bags on you just like he dumped it on Bed and Bath holders.\n\nNow comes the mob down-voting every comment I make, hoping it makes themselves feel better, but guess what? You will be holding the stock for the next year and refreshing the price every second only to see your portfolio lose more and more value each day.",
        "upvoteRatio": 0.10000000149011612
    },
    {
        "subredditNamePrefixed": "r/Superstonk",
        "author": "kk7766",
        "createdAt": "2024-06-10 21:06:04",
        "title": "For anyone still holding $GME....",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2024-06-10 12:39:41",
        "title": "Quick DD - Pretty good risk / reward for 100% gain in 30 mins",
        "selftext": "Idk who but someone started a rumor on fintwit that $AAPL would be replacing Safari with Opera $OPRA and announcing it at their WWDC event in 30 minutes. Twitter has been spamming this all day and the stock is up like 25%. I don't know why they would do this since they own Safari so it makes zero sense. Sure maybe they announce something with Opera but I'm calling bullshit. Anyways it's a good risk reward as 17.5 puts are selling for 1.75 and if they don't announce anything and it goes back to where it closed Friday it's over a 100% gain. \n\nSmall lotto position: \n\nhttps://preview.redd.it/i3h60jskur5d1.png?width=1490&format=png&auto=webp&s=5cdb4cb14c506c0f5b32f9bede51d98404da292f\n\n",
        "upvoteRatio": 0.8999999761581421
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2024-06-08 12:11:03",
        "title": "Made 212k this week with puts and calls on Gameshit",
        "selftext": "Made 212k this week playing both sides of the Gameshit trade (calls and puts, long and short) depending on the upcoming catalysts. Super easy trade. I wanted to post the DD for both sides for my followers (going long the day before the stream and going short after it) but I couldn't because the symbol was banned here. I posted this before but my opinion was it never should have been banned on WSB. I get it's annoying as fuck watching morons think they're part of some \"movement\" spamming the ticker nonstop but this was the biggest and easiest trade of the week and WSB should be about playing the top trending news stories of the week and then moving onto the next trade when it's over. \n\nI do get the mods side though. So many morons who buy it think they're part of a bigger cause and ruin the fun for everyone else. The funny thing is back in 2021 Roaring Kitty was a nobody and people like Andrew Left who were shorting it were in fact the \"big guys\" and the story made sense. Now Roaring Kitty's net worth is like 100x Andrew Left's. Any moron who think they're still fighting for the little guy is a complete idiot. Also a future bagholder because the trade is over. Onto the next one. Follow me and I'll post any upcoming DD I see in the market (if it's not banned here lol)  ",
        "upvoteRatio": 0.6000000238418579
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2024-06-08 12:09:09",
        "title": "Made 212k this week with puts and calls on Gameshit",
        "selftext": "",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/PhotoshopRequest",
        "author": "kk7766",
        "createdAt": "2024-04-30 23:16:02",
        "title": "Anyone here knowledgeable on cars / car design? ",
        "selftext": "I'm buying a pre-owned Ferrari and I'm wanting to get a matte wrap and some sort of stripe design on it. I have a few ideas in my head but it would be really helpful to see what the different stripe designs would look like on the car digitally. The dealership wants to know the exact color and size I want, and I won't know until I see it on the car. If someone here is a professional photoshop editor and also knowledgeable about cars, send me a message, some of your work and what your price would be. Thanks. ",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/Ferrari",
        "author": "kk7766",
        "createdAt": "2024-04-30 20:37:01",
        "title": "Any car graphic designers here or someone who can point me in the right direction? ",
        "selftext": "I'm buying a pre-owned Ferrari and I'm wanting to get a matte wrap and some sort of stripe design on it. I have a few ideas in my head but it would be really helpful to see what the different stripe designs would look like on the car digitally. The ferrari dealership I'm buying the car from is going to do the matte wrap and stripes with a shop they work with but they said they can't show me different designs digitally and want to know exactly what I want.",
        "upvoteRatio": 0.550000011920929
    },
    {
        "subredditNamePrefixed": "r/cars",
        "author": "kk7766",
        "createdAt": "2024-04-30 20:34:40",
        "title": "Any car graphic designers here or someone who can point me in the right direction? ",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/MSTR",
        "author": "kk7766",
        "createdAt": "2024-04-22 11:52:14",
        "title": "What is everyone's end of year Price Target for $MSTR?",
        "selftext": "My EOY price target is $400 a share. What's yours? ",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/MSTR",
        "author": "kk7766",
        "createdAt": "2024-04-15 14:17:06",
        "title": "If you started posting here in March - April you bought the top",
        "selftext": "congrats on being a bagholder ",
        "upvoteRatio": 0.7799999713897705
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2024-03-19 09:49:05",
        "title": "These calls could be 500 Baggers. Turn $1,000 into $500,000",
        "selftext": "Okay, I already know I'm gonna get a bunch of hate for this post, so I only ask that you read the entire  post  before replying. I honestly think this could be the biggest trading opportunity since Jan 2021.\n\n&#x200B;\n\nHere are my positions: March 28th $50, $60, $70, $80 and $85 calls -\n\nhttps://preview.redd.it/bcnhv5qopapc1.png?width=1418&format=png&auto=webp&s=bb941a2224ecc3174002372e066241af8e5d0727",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2024-03-19 09:42:17",
        "title": "These calls could be 500 baggers. Turn $1,000 into $500,000",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2024-03-19 09:39:06",
        "title": "These calls could be 500 baggers. Turn $1,000 into $500,000",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/Watches",
        "author": "kk7766",
        "createdAt": "2024-02-07 22:30:35",
        "title": "[Cartier] Dropped some daytrading money on a watch and bracelet",
        "selftext": "Corny steering wheel pic but I like this combo *back to trading*",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/Watches",
        "author": "kk7766",
        "createdAt": "2024-02-07 22:27:49",
        "title": "Dropped some daytrading money on a watch and bracelet",
        "selftext": "Corny steering wheel pic but I like this combo \\*back to trading\\* \n\nhttps://preview.redd.it/fcayc76r5ahc1.jpg?width=1227&format=pjpg&auto=webp&s=2a5a4af57c7aaf57d064ab736528ab55c0720768\n\n&#x200B;",
        "upvoteRatio": 0.5
    },
    {
        "subredditNamePrefixed": "r/AutoTransport",
        "author": "kk7766",
        "createdAt": "2024-01-28 23:09:38",
        "title": "Want to ship my car from Orlando to NYC next week. Are there any companies that set an EXACT time for pick up?",
        "selftext": "Never done this before. I'm in Orlando right now and going back to NYC next Saturday. I don't feel like driving so was gonna have my car shipped. I thought this would be an easy thing to do but after reading reviews online it seems like it's a bust. Are there any companies where I can schedule a pickup at an EXACT time? Say Saturday at 11 AM? Maybe a 1 hour window? ",
        "upvoteRatio": 0.8299999833106995
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2024-01-22 16:00:50",
        "title": "Update: Sold 2/3 of my position now. Made $300,000 in a single day. Holding onto 1/3. $DWAC",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2024-01-22 12:36:22",
        "title": "$100k gain in a day $DWAC",
        "selftext": "Only sold 1/3 of my position. The 100k I made today is the 1/3 I sold. It will keep going up until Trump wins the primary and TMTG goes public so I'm gonna hold onto the other 2/3. $DWAC is gonna turn into TMTG Trump Media & Technology Group in a couple of weeks. Bullshit company but super low float and backed by Trump cult. \n\n&#x200B;\n\nhttps://preview.redd.it/rjtbp0l321ec1.png?width=2574&format=png&auto=webp&s=03fbf037457db1f181b753813d87fa825756389c",
        "upvoteRatio": 0.8600000143051147
    },
    {
        "subredditNamePrefixed": "r/CollectibleAvatars",
        "author": "kk7766",
        "createdAt": "2024-01-20 00:36:11",
        "title": "Any suggestions for my avatar?",
        "selftext": "I'm getting a theme going by mixing and matching but there's so many to choose from to add little things here and there I can't possibly look at them all ",
        "upvoteRatio": 0.7200000286102295
    },
    {
        "subredditNamePrefixed": "r/GME",
        "author": "kk7766",
        "createdAt": "2023-09-28 13:00:59",
        "title": "WHY ARE WE RED?!???!?! RYAN COHEN!!!!!!!!",
        "selftext": "RYAN COHEN!!!!\n\nRYAN COHEN!!!!\n\nRYAN COHEN!!!!!!\n\nIF HES IN IM IN!!!!!!\n\nDIAMOND HANDS!!!!!!!\n\nFUK U KEN GRIFFIN!!!!!!!\n\nSQUEEZE THE SHORTS!!!!!!!\n\n$1,000 PT!!!!!!!\n\nMOASS!!!!!!!!!\n\nWHAT IS A CALL OPTION!!!!!!!!",
        "upvoteRatio": 0.6000000238418579
    },
    {
        "subredditNamePrefixed": "r/amcstock",
        "author": "kk7766",
        "createdAt": "2023-08-28 15:53:42",
        "title": "I am putting my life savings in $AMC!!!!! HODL!!!!! APES UNITE!!!!!!",
        "selftext": "I just put a limit order to put $1,000,000 in $AMC shares. I set the limit order to buy 500,000 shares for $2 each. Will probably be filled by end of week. Let's go apes!!!!!!",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/amcstock",
        "author": "kk7766",
        "createdAt": "2023-08-28 13:51:23",
        "title": "WHEN POUNCE?!??!?!?!",
        "selftext": "ADAM AARON SAID WE WILL POUNCE THE SHORTS!!!!!! WHEN POUNCE?!?!?!?!?! 😂😂😂😂😂😂😂😂😂",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/stocks",
        "author": "kk7766",
        "createdAt": "2023-08-18 22:37:14",
        "title": "Too many people on here call Daytrading gambling - It is not",
        "selftext": "I'm a daytrader (not TA) and that's my only source of income. Daytrading gets a horrible reputation on here by people who suck at it and people who don't understand it. If you ever lost money with options daytrading and think you're gambling you just didn't know what you're doing. This is a 2 year chart of my daytrading account:\n\n[https://i.imgur.com/eqqblul.png](https://i.imgur.com/eqqblul.png)\n\nSure it's possible to make educated bets every now and then. I do that sometimes too for the risk/reward potential and I have loses because of that. However there are trades that are 90%+ certain if you know what you're doing based on intraday moves and headlines. \n\nNote on Technical Analysis daytraders who draw lines on charts and look for patterns. That's the biggest bullshit ever. That is 100% gambling, I have never done that. \n\nLong story short - you can make a real profession daytrading. You just have to do it and find certain things that will always work and you will be set for life. However in the process of learning you could lose all your money so trade with a paper account or very low amounts for at least a year....probably more. \n\n&#x200B;",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2023-08-17 09:45:54",
        "title": "Easy Short for a possible 500% gain by next month",
        "selftext": "$DWAC has been trying to merge with Trump's company Truth Social for the past 2 years. The problem is the SEC has been investigating them making it impossible for them to merge. The SEC finally resolved the lawsuit so the stock jumped from $12 to $17 where it is now on that headline  \n\n\nSo what's the problem? They haven't filed their S4 yet and don't plan to in October. However the SPAC will **EXPIRE** and **LIQUIDATE** on September 8th meaning as of right now on September 8th the SPAC will automatically go to $10.40. The ONLY way it can be saved by the MAGA people is if they vote to extend the SPAC for a year.\n\nThe problem with the vote is they need over 65% shareholder approval to pass the vote to save the SPAC. There was supposed to be a meeting today to tally the vote total, but the vote failed and they extended the meeting to September 5th. **IF THE VOTE DOESN'T PASS BY THE NEXT MEETING IT'S OVER FOR THEM.**\n\nIt's super hard to get 65% shareholder approval, especially when 90% of the people who own the stock are retail investors who don't even know they own it. Last year it took them over 4 months to pass this vote but this year they hardly have any time.\n\nPositions: Right now $15 puts expiring September 15th are trading for $1.00 meaning they will be worth $5.00 when the SPAC liquidates. It is also an easy short now until the next meeting on September 5th\n\n&#x200B;\n\nhttps://preview.redd.it/tf598qsxcoib1.png?width=2182&format=png&auto=webp&s=2677424d1facfb7c12b0cb9c307ec53080e3cd92\n\n&#x200B;",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2023-07-30 14:30:58",
        "title": "$BUD Bud Light (Anheuser-Busch) reports earnings Wed night/Thurs morning",
        "selftext": "$BUD Bud Light (Anheuser-Busch) reports earnings for the first time since the boycott started and the numbers will show a huge decline in American sales. I'll keep the DD very simple.\n\n**Go woke, Go broke**\n\nPositions: $BUD 55 Puts, $BUD 54 Puts\n\nhttps://preview.redd.it/c59jcr5rb5fb1.png?width=2146&format=png&auto=webp&s=9ba26000470cc9b63a2522571193654a3815739b\n\nSell before earnings or hold thru earnings? That's your choice but the IV increase will happen",
        "upvoteRatio": 0.6899999976158142
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2023-04-02 14:03:33",
        "title": "Helping the WSB gain counter with $72,684 gain in March",
        "selftext": "March was a pretty good month. I'll outline some of the biggest positions for me below.\n\n&#x200B;\n\nhttps://preview.redd.it/9jfl9drlgira1.png?width=2996&format=png&auto=webp&s=bc75e3cfdbeb4cbbbd0218f105ca421faf40c201\n\n1. The regional banks were the biggest trade. They weren't random or TA buys mostly bought on headlines that moved the stocks.\n2. SPY calls/puts while JPow is talking is always pretty easy but you have to be in and out quick\n3. Gamestop puts at open after earnings was the easiest play of all month\n4. $SNAP had consistent gains buying calls/puts based on TikTok news\n5. $AMC buy the rumor/sell the news with $AMZN takeover (bullshit story)\n6. $DWAC with the Trump indictment shit\n7. $BA production headlines\n8. $SQ Hindenburg short report\n\nAs   you can see I trade on headlines fairly well. Been doing it for over 3   years now and have 1,000% account gain since then. Sometimes I'll post   DD when feeling generous.\n\n**\\*\\*\\*NOTE\\*\\*\\* I had to remove the \"E\" in Gamestop from the screenshot because WSB filters won't let me post the ticker or a picture of the ticker because it's saying it's under 500m market cap even though it's 7B. Whoever does these WSB filters is an idiot**\n\n[https://i.imgur.com/KXda9Yb.png](https://i.imgur.com/KXda9Yb.png)",
        "upvoteRatio": 0.8999999761581421
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2023-04-02 14:00:08",
        "title": "Helping the WSB gain counter with $72,684 gain in March",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2023-02-07 11:55:39",
        "title": "Made over $20,000 with $MSFT Calls. Posted a DD yesterday when I bought on WSB and WSB voted to take it down because it was \"low effort DD\"",
        "selftext": "Over $20,000 Gain: \n\n&#x200B;\n\nhttps://preview.redd.it/vvk7cd83rsga1.png?width=2498&format=png&auto=webp&v=enabled&s=c22fa3abc1f85832bf709b7687eea86668f83699\n\nMy DD post yesterday: \n\n&#x200B;\n\nhttps://preview.redd.it/pot1rs48rsga1.png?width=1476&format=png&auto=webp&v=enabled&s=260814ff68742510d97181654952eec564c730ea\n\n&#x200B;\n\nhttps://preview.redd.it/rhibdp0drsga1.png?width=1494&format=png&auto=webp&v=enabled&s=0417bd29d40fa587940598e0faf3dc4b132ce5ed\n\nGood job WSB ! Keep listening to the crap DD that gets posted",
        "upvoteRatio": 0.9100000262260437
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2023-02-07 08:28:20",
        "title": "Dumbass WSB users keep deleting my DD so I'm posting as discussion now",
        "selftext": "[removed]",
        "upvoteRatio": 0.46000000834465027
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2023-02-06 16:03:48",
        "title": "Microsoft $MSFT just announced a surprise event for tomorrow (Tuesday) at 1PM - Speculation it's AI related",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2023-02-06 16:02:00",
        "title": "Microsoft just announced a surprise event for tomorrow (Tuesday) at 1PM - Speculation it's AI related",
        "selftext": "[removed]",
        "upvoteRatio": 1
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-12-28 16:17:11",
        "title": "Building up a 10k Call position for $TSLA expiring next week",
        "selftext": "[removed]",
        "upvoteRatio": 0.6299999952316284
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-11-12 17:10:57",
        "title": "Rumble $RUM is currently valued at 3.65 Billion. It reports it's first earnings ever on Monday after close. Revenue is expected to be 6 Million and EPS negative",
        "selftext": "With a market cap of 3.65 Billion and 6 Million in revenue and negative EPS **$RUM** may be the most overvalued stock on the entire stock market right now. It's a SPAC that should be at $2 with all the others but it's well above $10. It reports it's first earnings since going public on Monday and if it follows all the other SPACs it could fall over 50%.\n\nI made a post that I was short **$RUM** at $14 in September then the next day it jumped to $17 on massive press about going public and everyone laughed. But within the next few weeks it fell to $6 and I covered. So was right and made a lot of money. Well I am short again. It went back up because of the election season run-up and Republicans winning but that's all over now. There's really no more catalysts for it to run anymore.\n\nI would recommend going short **$RUM** here and holding on until Jan/Feb. Weekly puts are also cheap for earnings on Monday if you wanna play lottos but shorting is safer.",
        "upvoteRatio": 0.8100000023841858
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-10-15 18:34:07",
        "title": "When is Elon gonna make an account here? Believe it or not, he has probably the biggest loss porn in a single trade in history",
        "selftext": "Based on $META and $SNAP price YTD $TWTR should be around $15 right now (that's being generous). He paid $54.20 or 44 Billion. That is a loss of over $30 billion dollars on a single trade.\n\n&#x200B;\n\nhttps://preview.redd.it/glwsruvbr1u91.jpg?width=1280&format=pjpg&auto=webp&s=bc67eb5afbd389c5dbf2b335c7073875a18d3bb8",
        "upvoteRatio": 0.9599999785423279
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-10-15 15:28:11",
        "title": "Almost 600% Gain in a Year",
        "selftext": "",
        "upvoteRatio": 0.8199999928474426
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-09-09 12:12:02",
        "title": "New \"Buy The Rumor, Sell The News\" of the week",
        "selftext": "I'll keep this post short. August was the first month inflation came down significantly, especially gas prices. CPI will be lower than the last two reports. My thesis is everyone is buying yesterday, today and probably Monday for the low CPI report Tuesday. We could even open high on Tuesday when the report comes in low but probably dump at open and continue lower into the next fed meeting, completing \"Buy The Rumor, Sell The News\"\n\n**POSITIONS: Calls on Tech / Indexes until Monday or Tuesday morning**",
        "upvoteRatio": 0.8600000143051147
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-09-06 17:13:17",
        "title": "From the guy who bought you the $DWAC put 10 bagger....$DWAC may have a big short covering tomorrow lol",
        "selftext": "Today  was mostly people shorting $DWAC as they are not going to get enough  votes and may have chosen to liquidate Thursday and the shares would be  $10.20 on Friday. Even though they extended the vote to Thursday they  are probably still not going to get the votes needed. The only option  they had was to fork over $2.8 million to extend it 3 months or \\~$6  million to extend to 6 months. At 3:50 PM they announced they were  extending it to 3 months (for now).\n\n*\"If  the Extension Amendment is not approved by the stockholders by   September 8, 2022, ARC Global Investments II, LLC, the Company's sponsor   (the \"Sponsor\"), intends to contribute to the Company's trust account   an aggregate amount of $2,875,000, which is equal to $0.10 per share of   Class A common stock issued in the Company's initial public offering,  to  extend the time to consummate an initial business combination for a   three-month period, until December 8, 2022.\"*\n\nAs  I announced on the thread I sold my puts at 11 AM with the increased IV  for $85k profit and would monitor the news to go back into puts or  calls depending what they decided to do. With this news, the stock is NOT going to $10.20 on Friday no matter what happens. As today was  mostly people shorting the stock rather than the die-hard Trumpers  selling I am expecting a big short covering tomorrow.  Also it's kind of bullish they are paying $3 million they can't get back to extend....maybe they think the merger will happen. Nothing crazy tomorrow but maybe a 10%+ rally. Maybe even 20% if people wanna get crazy but I'm waiting for 10% to sell.\n\n**Positions: 20 $10 $DWAC calls expiring Friday for $11.50 and 10,0000 DWAC warrants for $4.90 (you can still buy them AH)**",
        "upvoteRatio": 0.6700000166893005
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-09-03 13:22:00",
        "title": "Good Risk/Reward to turn 10k into 200k (2000% gain)",
        "selftext": "**$DWAC**'s deadline to merge  with Truth Social is on Thursday and if they're not merged (they won't be) stock will liquidate and fall back to $10 on Friday. They have a shareholder vote on Tuesday after market close to extend the deadline another year but need 65% of shareholder approval (not voting means no) and they won't get that cause nobody knows about it. IV is not priced into options yet,  they are super cheap right now. Easy way to turn 10k into 200k, good risk/reward.\n\nNote: I am almost certain the vote won't pass. However, there is an option for **$DWAC** to extend up to 6 more months until March but they would have to put up around $6 million of their own cash to do so and that's the longest they can possibly extend it to. The SEC won't finish their investigation by then and they won't get the $6 million back so it's a coin toss whether they'll pay the $6 million when the vote fails to then ultimately liquidate in March or just liquidate on Thursday. \n\n**Positions: Bought $30k of $DWAC puts expiring next week.**",
        "upvoteRatio": 0.8399999737739563
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-08-17 21:48:22",
        "title": "Congrats to whoever bought $BBBY at $30.00",
        "selftext": "That will be the high for the rest of the year. Slow bleed until then with random pumps to get the brand new kids here circle-jerking eachother thinking they'll finally make money only for it to fall further. Congrats to whoever made money on it. I made 30k in puts from last week and this week. PT $10 in a couple weeks",
        "upvoteRatio": 0.15000000596046448
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-08-07 16:51:36",
        "title": "I need help from any professional options traders who use RobinHood as their platform",
        "selftext": "I've been using ETrade to trade options. Love the platform, no problem. So far YTD I've done $250k in net profit so it's been a good year. However looking at how much in total commission and fees I've paid it's around $50k. That's like a whole year worth of rent and kind of ridiculous. \n\nObviously RobinHood's 0 commission/fee option trading interests me. I've always been told to stay far away from RH and their fills are horrible. What does that mean exactly? If I put a limit order to say buy 100 contracts for $1 each at ETrade and RH while the stock is falling and it eventually hits the limit price that ETrade will fill my order before RH does? Is there like a major delay or any delay at all in RH? I need to know if the zero commission trading on RH Is too good to be true otherwise I'm going to switch.",
        "upvoteRatio": 0.36000001430511475
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-04-29 12:50:19",
        "title": "April gain post as promised - not as good as March but still $69k",
        "selftext": "Good month but should have been better. Lots of stupid mistakes made which are still bugging me. Biggest play of the month was **$TWTR** calls / puts playing along the Elon Musk Twitter story as news developed. Also **$DWAC** calls / puts and **$TSLA** puts during the whole Elon shit. So I can basically thank Elon for the best plays for this month. Some other puts too were in there from fear of rate hikes, inflation, supply chain issues, war, China, you know the shit. Oh and **$AMZN** earnings today cause I knew the **$RIVN** shit would fuck up their numbers cause it hid their numbers last time. Sold too early on that one. \n\n[https://i.imgur.com/QtGdbTc.png](https://i.imgur.com/QtGdbTc.png)\n\n&#x200B;\n\nhttps://preview.redd.it/80d7npw7zhw81.png?width=2426&format=png&auto=webp&s=a6596ee4cb9a4fbfbe51a4f6697a660052e8819d",
        "upvoteRatio": 0.9200000166893005
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-04-20 12:12:03",
        "title": "$30,000 gain in one day thanks to moron retail overnight traders",
        "selftext": "Thanks for bidding up tech even though $NFLX was a complete disaster. This was probably by far the easiest play of the year. I honestly don't know what the fuck premarket was and who the idiots who trade it are. They are almost always wrong.   \n\n\n**Positions:** $QQQ and $TSLA puts. For the record I think it goes lower but I sold 80% of it now to lock in profit and I'm busy for rest of the day. Also since they're 0dte and weeklies the best thing you can learn is not be greedy. \n\n[https://i.imgur.com/vKMgTYE.png](https://i.imgur.com/vKMgTYE.png)\n\n  \n\n\nhttps://preview.redd.it/92guz8tekpu81.png?width=2438&format=png&auto=webp&s=058b70dcee2fcba35c9665623bb76606a384c217",
        "upvoteRatio": 0.75
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-04-18 15:28:30",
        "title": "Over $40,000 gain in 2 weeks thanks to Elon Daddy",
        "selftext": "Over $40,000 gain within the last two weeks from Elon causing Twitter drama. Positions included $TWTR long shares, shorting, calls and puts. Basically playing the story on the long and short side as the story developed. One of the easiest plays of the year so far. \n\nFor anyone who asks, no current position at the moment. $TWTR will trade relatively flat until the board makes a decision. \n\n[https://i.imgur.com/9NXJ9Mz.png](https://i.imgur.com/9NXJ9Mz.png)\n\n   \n\n\nhttps://preview.redd.it/amsmhw3f9cu81.png?width=2440&format=png&auto=webp&s=c7e0889d19b501adcd1c671766c735c64dc3b3e3",
        "upvoteRatio": 0.800000011920929
    },
    {
        "subredditNamePrefixed": "r/wallstreetbets",
        "author": "kk7766",
        "createdAt": "2022-04-16 15:44:27",
        "title": "March was a good month",
        "selftext": "Over 100k gain\n\n**Positions:**\n\n1. Oil puts right before Biden spoke about banning Russian Oil Imports\n2. Growth calls before JPow raised interest rates\n3. China calls when China gov said they'd start supporting the market\n4. Weed puts when house passed bill\n5. $GME puts on any crazy spike\n\nThat was the majority of it. Will do April post in a few weeks\n\n[https://i.imgur.com/yWlxerU.png](https://i.imgur.com/yWlxerU.png)\n\n&#x200B;\n\nhttps://preview.redd.it/l1262crw2yt81.png?width=2450&format=png&auto=webp&s=b3c308f3c172a3e4c6b7e1623343d9d25627b062",
        "upvoteRatio": 0.8199999928474426
    },
    {
        "subredditNamePrefixed": "",
        "author": "kk7766",
        "createdAt": "2021-01-29 16:48:15",
        "title": "The other side of the GameStop argument and why what Reddit users are doing is unethical",
        "selftext": "The mainstream media writing stories that the little guys on reddit are taking on the big billionaire corporations makes for a nice feel-good story and has gained nationwide attention and new investors interested in the stock market. What's really happening though is a bunch of people from WSB who bought the stock at $15 two weeks ago telling all these new investors to buy at $480 because it's \"going to $10,000.\" The people who trade know that's obviously not gonna happen but all these new kids or people who have never bought a stock before who see  the media praising WSB right now will go on the forum, see everyone  saying it'll be \"$10,000 next week\" and believe them. In the end we all  know who will lose serious money from this....the new investors and kids who can't afford it. Not the billionaires and not professionals ",
        "upvoteRatio": 0.4099999964237213
    },
    {
        "subredditNamePrefixed": "",
        "author": "kk7766",
        "createdAt": "2021-01-17 17:46:03",
        "title": "What is considered a high GSP in Elite Smash?",
        "selftext": "I'm currently at 8,800,928 wish Yoshi. How high does it go?",
        "upvoteRatio": 1
    }
]